---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarConstraint
source: html/f70f7a66-65ba-8d3c-be13-11a568ae296e.htm
---
# RebarConstraint Properties

Specifies whether the .NET object represents a valid Revit entity.